///*************************************************
//* Filename      :  
//* Version       :  
//* Describtion   : 
//* Creator				:
//* Date					:
//********************************************/
//#include "USER_PPM.h"
//#include "dma.h"
//#include "tim.h"
//user_ppm_t  user_ppm;
//	
///***************************************************************************************************************************
//* Function Name  :  
//* Description    :  
//* Input          :  
//* Output         :  
//* Return         :  
//****************************************************************************************************************************/
////读取四个涡流接近开关状态，感应到输出0v，未感应到输出5V
//	uint8 user_sw_state_RD(int* AD_val)
//	{
//		int i;
//		uint8 val = 0xff;
//		for(i=0;i<4;i++)
//		{
//			if(AD_val[i]<2500)//小于2V，感应到了，输出0V
//			{
//			
//				val =val&(~(0x01<<i));
//			}
//		}
//		return 0;
//	}
//	

///*********************************************************************************************
//* Function Name  :  
//* Description    :  
//* Input          :  
//* Output         :  
//* Return         :  左开
//*******************************************************************************************/
////void user_DO1_output(uint16 pwm_val)
////{
//////	HAL_TIM_PWM_Start(&htim1,TIM_CHANNEL_1);//电机5;
//////	 __HAL_TIM_SetCompare(&htim1, TIM_CHANNEL_1,  pwm_val); //0.8V 
////}



